Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: A pin is a convenient component for interacting with a circuit, and beginning Logisim users need not use them in any other way.
ru_ru: Контакт - удобный компонент для взаимодействия со схемой, и начинающим пользователям Logisim не нужно использовать их каким-либо другим образом.

source: // retrieve its Graphics object (painter.getGraphics) so you can draw
ru_ru: // получить его объект Graphics (painter.getGraphics), так что вы сможете рисовать

source: Counter
ru_ru: Счётчик

source: If you have multiple ROM modules in parallel, you can use this input to enable or disable the entire ROM module, based on whether the value is 1 or 0.
ru_ru: Если у вас несколько модулей ПЗУ параллельно, то вы можете использовать этот вход, чтобы включить или отключить весь модуль ПЗУ, в зависимости от того, какое значение на этом входе: 1 или 0.

source: The correspondence is as follows.
ru_ru: Соответствие следующее.

source: Output?
ru_ru: Выход?

source: Rotate Left: All bits in data are shifted up dist places, with the top dist places wrapped around into the bottom.
ru_ru: Циклический левый: все биты в данные сдвигаются вверх на дистанция позиций, а верхние дистанция позиций прокручиваются вниз.

source: Wiring Library
ru_ru: Библиотека Проводка

source: The Simulate menu
ru_ru: Меню Моделировать

source: The value of this attribute cannot be changed.
ru_ru: Значение этого атрибута не может быть изменено.

source: As of this writing, the supported locales include:
ru_ru: На момент написания поддерживаются следующие языки:

source: Load Image...: Resets all values in memory based on the values found in a file using the format described below.
ru_ru: Загрузить образ...: устанавливает все значения в памяти, основываясь на значениях, содержащихся в файле, используя формат, описанный ниже.

source: Memory Library
ru_ru: Библиотека Память

source: This output behavior is enabled if out is 1 or undefined; if out is 0, then no value is pushed onto D - but if there is a combined load/store port, stores will be enabled.
ru_ru: Такое поведение выхода разрешено, если на входе out 1 или неопределённость; если же на входе out 0, тогда никакого значения не будет передано на D, а если порт - совмещённый для чтения/записи, то будет разрешена запись.

source: Logisim allows you to add more libraries, too, using the Load Library submenu of the Project menu.
ru_ru: Logisim также позволяет вам добавлять другие библиотеки с помощью подменю Загрузить библиотеку в меню Проект.

source: As long as this remains 0 or 1, the other inputs on the west edge have no effect.
ru_ru: Пока значение на этом входе остаётся 0 или 1, другие входы на западном крае не имеют эффекта.

source: // have clicked within a label, but that will be outside the bounds.
ru_ru: // нажать на метке, но это будет за пределами границ.

source: When the mouse button is pressed, the component's output will be 1.
ru_ru: Когда кнопка мыши нажата, значение на выходе компонента будет 1.

source: Reset: When this is 1, the pseudorandom sequence asynchronously resets to the initial seed.
ru_ru: Сброс: когда на этом входе 1, псевдослучайная последовательность асинхронно сбрасывается на начальное семя.

source: We will discuss each of these tabs separately.
ru_ru: Мы будем обсуждать каждую из этих вкладок отдельно.

source: The command line
ru_ru: Командная строка

source: (It's better to click directly on the input pin than to click where you want the text to go, because then the label will move with the pin.) You can do the same for the output pin.
ru_ru: (Лучше щёлкнуть непосредственно на входном контакте, чем там, где вы хотите, чтобы был текст, потому что тогда метка будет двигаться вместе с контактом.) Вы можете сделать то же самое для выходного контакта.

source: Next: The Toolbar tab.
ru_ru: Далее: Вкладка Панель инструментов.

source: Specifies whether the component is an output pin or an input pin.
ru_ru: Определяет, будет компонент выходным контактом или входным.

source: Next: Wire colors.
ru_ru: Далее: Цвета проводов.

source: * is 4.
ru_ru: * равен 4.

source: Wrap around
ru_ru: Закольцовывать

source: South edge, first from left (input, bit width 1)
ru_ru: Южный край, первый слева (вход, разрядность равна 1)

source: If any bits for a row are floating or error values, then all pixels in the row are lit.
ru_ru: Если какие-либо биты в строке имеют плавающее значение, или значение ошибки, то все пиксели в строке горят.

source: West edge, variable number (inputs, bit width matches Data Bits attribute)
ru_ru: Западный край, переменное количество (входы, разрядность соответствует атрибуту Биты данных)

source: This section explains the six menus that accompany every major Logisim window.
ru_ru: Этот раздел объясняет шесть меню, которые сопровождают все основные окна Logisim.

source: The blue circles and squares with dots in them are the subcircuit's ports. There are exactly as many ports as there are input and output pins in the circuit.
ru_ru: Синие круги и квадраты с точками в них - это порты подсхемы. Портов в точности столько, сколько входных и выходных контактов в схеме.

source: You can also shorten or delete an existing wire segment by initiating a drag at the terminus of the segment and then drawing backwards across the segment.
ru_ru: Вы также можете укоротить или удалить существующий сегмент провода, начав перетаскивать конец этого сегмента назад вдоль сегмента.

source: Logisim will maintain different state information for all subcircuits appearing in a circuit.
ru_ru: Logisim будет поддерживать информацию о разных состояниях для всех подсхем, входящих в схему.

source: J-K Flip-Flop: When the clock triggers, the value remembered by the flip-flop toggles if the J and K inputs are both 1 and the value remains the same if both are 0; if they are different, then the value becomes 1 if the J (Jump) input is 1 and 0 if the K (Kill) input is 1.
ru_ru: J-K триггер: когда тактовый вход срабатывает, значение, хранящееся в триггере, меняется, если на входах J и K единица; остаётся прежним, если на них 0; если значения на них различны, то значение становится единицей, если на входе J (Прыжок) - 1; или нулём, если на входе K (Забой) - 1.

source: Gates
ru_ru: Элементы

source: In any case, if you are confident that the reporting is in error, you can configure the number of iterations completed before oscillation occurs via the Project Options window's Simulation tab.
ru_ru: В любом случае, если вы уверены, что сообщение - ошибка, то вы можете настроить количество итераций, завершённых до появления возбуждения через вкладку Моделирование окна Параметры проекта.

source: East edge, labeled -x (output, bit width matches Data Bits attribute)
ru_ru: Восточный край, отмечен -x (выход, разрядность соответствует атрибуту Биты данных)

source: Next: The attribute table.
ru_ru: Далее: Таблица атрибутов.

source: In particular, a circuit layout's pin components define the pins that appear on the subcircuit component when the layout is used within another circuit.
ru_ru: В частности, компоненты Контакт чертежа схемы определяют контакты, которые отображаются на компоненте Подсхема, когда чертёж используется внутри другой схемы.

source: For example, suppose we want to create smaller AND gates.
ru_ru: Например предположим, что мы хотим создавать маленькие элементы И.

source: When you select a tool, Logisim will change the attribute table to display that tool's attributes.
ru_ru: Когда вы выбираете инструмент, Logisim изменит таблицу атрибутов для отображения атрибутов инструмента.

source: Bit Adder
ru_ru: Сумматор битов

source: Logisim supports two categories of configuration options: application preferences and project options.
ru_ru: Logisim поддерживает две категории параметров конфигурации: настройки приложения и параметры проекта.

source: Controls the upper vertical segment on the right side.
ru_ru: Управляет верхним вертикальным сегментом на правой стороне.

source: Enters the logging module, which facilitates automatically noting and saving values in a circuit as a simulation progresses.
ru_ru: Входит в модуль записи в журнал, который помогает автоматически отмечать и сохранять значения в схеме во время процесса моделирования.

source: Pins (assuming component faces east, gate line top/left)
ru_ru: Контакты (предполагается, что компонент направлен на восток, положение затвора - сверху/справа)

source: This behavior is summarized by the following table.
ru_ru: Это поведение обобщено следующей таблицей.

source: Its first part is a sequence of sections introducing the major parts of Logisim.
ru_ru: Его первая часть представляет собой последовательность разделов, представляющих основные части Logisim.

source: However, in real life, a gate will behave unpredictably in such a situation, and so this drop-down menu allows one to change the gates so that they treat such disconnected inputs as errors.
ru_ru: Однако в реальной жизни элементы будут вести себя непредсказуемо в такой ситуации, и поэтому это раскрывающееся меню позволяет изменить элементы так, что они будут обращаться с такими отключенным входам как с ошибками.

source: This will generally not be necessary, as edits to the truth table result in using the minimized expression for the changed column; but if you enter an expression through the Expression tab, this can be a convenient way to switch to the corresponding minimized expression.
ru_ru: Это, как правило, не нужно, поскольку изменения в таблице истинности приводят к использованию минимизированного выражения для изменённого столбца; но если вы введете выражение через вкладку Выражение, то это может быть удобно, чтобы перейти к соответствующему минимизированному выражению.

source: A 1 indicates to light the corresponding pixel, while a 0 indicates to keep the pixel dim.
ru_ru: 1 указывает подсветить соответствующий пиксель, а 0 - оставить его не подсвеченным.

source: The number represents the number of clicks of the internal hidden clock (a simple gate takes just one click).
ru_ru: Число представляет собой количество срабатываний скрытого тактового генератора (простой логический элемент тратит всего одно срабатывание).

source: About This Program
ru_ru: Об этой программе

source: But at least it tries.
ru_ru: Но он по крайней мере пытается.

source: As long as the clock input remains 0 or 1, though, the D value will not be stored into memory.
ru_ru: Но пока на тактовом входе сохраняется 0 или 1, значение входа D не будет записано в память.

source: * be 30x30, and we're anchoring it relative to its primary output
ru_ru: * 30x30, и закрепляем его относительно его основного выхода

source: // You might be tempted to propagate the value immediately here, using
ru_ru: // Вы, возможно, подумываете о том, чтобы просчитать значение здесь сразу, используя

source: This window can be opened in two ways.
ru_ru: Это окно можно открыть двумя способами.

source: Or you could just click any old place and start typing to put a label anywhere else.
ru_ru: Или вы можете просто щёлкнуть в любом другом месте и начать ввод, чтобы поставить метку где-нибудь ещё.

source: * the new instance is pretty thoroughly configured already by default.
ru_ru: * новый экземпляр уже довольно хорошо настроен по умолчанию.

source: Circuits: A list where you can select one or more circuits that should be exported into image files.
ru_ru: Схемы: Список, где вы можете выбрать одну или несколько схем, которые должны быть экспортированы в файлы изображений.

source: Logisim cannot construct a NAND-only circuit for an expression containing any XOR operators.
ru_ru: Logisim не может построить использующую только И-НЕ схему для выражений, содержащих любые операторы Исключающее ИЛИ.

source: Using redirection and shell scripts
ru_ru: Использование перенаправления и сценариев оболочки

source: A more complex circuit might include a RAM component that needs to be loaded with a program in order for the circuit to have anything to do.
ru_ru: Более сложная схема может включать компонент ОЗУ, который должен быть загружен с программой для того, чтобы схеме было что делать.

source: These parameters apply to all circuits being simulated in the same window, even for circuits that exist in other libraries loaded within the project.
ru_ru: Эти параметры применяются ко всем схемам, моделируемым в одном и том же окне, даже к схемам, которые существуют в других библиотеках, загруженных в проекте.

source: For example, a signal may end up entering a gate during one step, but the gate won't show a different signal until the next simulation step.
ru_ru: Например, сигнал может закончить поступать на элемент в течение одного шага, но элемент не будет показывать другой сигнал до следующего шага моделирования.

source: Once you have all the wires connected, all of the wires you inserted will themselves be light or dark green.
ru_ru: После того как вы подключили все провода, все добавленные вами провода будут светло- или тёмно-зелёными.

source: A probe is an element that simply displays the value at a given point in a circuit.
ru_ru: Датчик - элемент, который просто отображает значение в данной точке схемы.

source: In general, parentheses within a sequence of ANDs (or ORs or XORs) do not matter.
ru_ru: Вообще-то, скобки в последовательностях AND'ов (или OR'ов или XOR'ов) не имеют значения.

source: (Note that you cannot enable it until a file is selected below.) The button allows you to pause and restart file entry.
ru_ru: (Обратите внимание, что вы не можете включить её, пока не выбран файл ниже.) Кнопка позволяет приостанавливать и начинать снова запись в файл.

source: The behavior in unspecified if both inputs are 1.
ru_ru: Поведение не определено, если на обоих входах 1.

source: If any bits in either input are floating or error values, all pixels in the matrix are lit.
ru_ru: Если какие-либо биты любого входа имеют плавающее значение, или значение ошибки, то все пиксели матрицы горят.

source: After selecting the desired items in the selection, you can of course cut/copy/paste/delete all the items via the Edit menu.
ru_ru: После выделения необходимых объектов, можно, конечно, вырезать/копировать/вставить/удалить все объекты, через меню Правка.

source: This is equivalent to a Karnaugh map, but it applies to any number of input variables.)
ru_ru: Он эквивалентен карте Карно, но применим к любому числу входных переменных.)

source: This is like selecting Copy, then Paste, except that Duplicate doesn't modify or use the clipboard.
ru_ru: Это подобно выбору Копировать и затем Вставить, кроме того, что Дублировать не изменяет и не использует буфер обмена.

source: However, designers sometimes prefer to use matched pairs of transistors due to electrical issues with draining voltage that is more complex than Logisim attempts to simulate.
ru_ru: Однако конструкторы иногда предпочитают использовать сочетающиеся пары транзисторов из-за относящихся к электротехнике вопросов, связанных с напряжением утечки, что является более сложным явлением, чем те, что Logisim пытается моделировать.

source: This is meant to emulate the joysticks known from the days of classical arcade games.
ru_ru: Этот компонент задуман для эмуляции джойстика, известного со времён классических аркадных игр.

source: Tick Frequency
ru_ru: Тактовая частота

source: * The bit width can be a constant (like 1) or an attribute (as here).
ru_ru: * Разрядность может быть константой (например, 1) или атрибутом (как здесь).

source: When placing the subcircuit into a layout, the user can change the subcircuit's facing; the anchor's facing indicates in which direction the appearance is oriented.
ru_ru: При размещении подсхемы на чертеже, пользователь может изменить направление подсхемы; направление якоря указывает, в каком направлении ориентирован внешний вид.

source: Then click in the editing area where you want the first AND gate to go.
ru_ru: Затем щёлкните в области редактирования там, где вы хотите поместить первый элемент И.

source: For all other values on p-gate and n-gate, the output is an error value.
ru_ru: При всех других значениях на p-затворе и n-затворе, на выходе будет значение ошибки.

source: South edge, labeled 0 (input, bit width 1)
ru_ru: Южный край, отмечен 0 (вход, разрядность равна 1)

source: The component constantly outputs the same value on this pin: for a ground component, the output is an all-zero value, and for a power component, the output is an all-one value.
ru_ru: Компонент постоянно выдаёт одно и тоже значение на свой контакт: для компонента Земля на выходе будет значение, состоящее из всех нулей, а для компонента Питание на выходе будет значение, состоящее из всех единиц.

source: Select All
ru_ru: Выбрать все

source: Configuring Print
ru_ru: Настройка печати

source: This is erroneous, though, because another
ru_ru: Это ошибка, потому что другой

source: The window below corresponds to the following circuit.
ru_ru: Окно ниже соответствует следующей схеме.

source: part thereof, to be licensed as a whole at no charge to all third
ru_ru: ее часть, на условиях,

source: The key to understanding splitters is their attributes.
ru_ru: Ключ к пониманию разветвителей - их атрибуты.

source: North edge (output, bit width 1)
ru_ru: Северный край (выход, разрядность равна 1)

source: Move Up moves the currently selected component in the selection forward one spot.
ru_ru: Сдвинуть вверх перемещает компонент, выделенный в данный момент в выборке, вверх на одну позицию.

source: /** Processes a key by just adding it onto the end of the current value.
ru_ru: /**Обрабатывает клавишу, просто добавив её в конец текущего значения.

source: The component does not provide any method for accessing the upper dataBits bits.
ru_ru: Компонент не предоставляет никаких способов доступа к старшим битыДанных битам.

source: Multiplexer
ru_ru: Мультиплексор

source: We will have an eight-bit value coming from the input pin, and we want to split that into two four-bit values.
ru_ru: Мы будем иметь восьмибитное значение, поступающее с входного контакта, и мы хотим разделить его на два четырёхбитных значения.

source: The default rectangle can optionally include some letters that will appear in the middle of the rectangle.
ru_ru: Отрисовываемый по умолчанию прямоугольник опционально будет включать несколько букв, которые появятся в середине прямоугольника.

source: Recall that we're trying to build the following circuit in Logisim.
ru_ru: Вспомним, что мы пытаемся построить следующую схему в Logisim.

source: West edge, north end (input, bit width matches Data Bits attribute)
ru_ru: Западный край, северный конец (вход, разрядность соответствует атрибуту Биты данных)

source: (I know of no open-source competitors that approach Logisim's feature set.) Nonetheless, I remain interested in continuing to improve Logisim, and your suggestions will be most welcome.
ru_ru: (Мне не известны конкуренты с открытым исходным кодом, приближающиеся к Logisim по набору возможностей). Тем не менее, я по-прежнему заинтересован в продолжении улучшения Logisim, и ваши предложения будут только приветствоваться.

source: Raise Selection
ru_ru: Поднять выделение

source: The multi-bit input whose value is to be transformed.
ru_ru: Многобитный вход, значение на котором будет преобразовано.

source: Next: The Simulation tab.
ru_ru: Далее: Вкладка Моделирование.

source: You should only attempt this if you're an experienced Java programmer.
ru_ru: Вам стоит пробовать это, только если вы опытный Java программист.

source: You can view and edit application preferences via the Preferences... option from the File menu (or, under Mac OS, the Logisim menu), a window will appear with several tabs.
ru_ru: Вы можете просматривать и редактировать настройки приложения через пункт Настройки... из меню Файл (или из меню Logisim на Mac OS); появится окно с несколькими вкладками.

source: About the program
ru_ru: О программе

source: Shift-drag to create a square, and alt-drag to create the rectangle starting from the center.
ru_ru: Перетащите с Shift, чтобы создать квадрат, или с Alt, чтобы создать прямоугольник, начиная с его центра.

source: Provides the icons for controlling simulation that appear under the simulation tree.
ru_ru: Предоставляет значки для управления моделированием, которые появляются в режиме дерева моделирования.

source: Debugging subcircuits
ru_ru: Отладка подсхем

source: Saves the currently viewed project, prompting the user to save into a different file than before.
ru_ru: Сохраняет просматриваемый в данный момент проект, предлагая пользователю сохранить его в другой файл.

source: Logisim's algorithm for simulating the propagation of values through circuits is not something that you normally need to worry about.
ru_ru: Алгоритм Logisim для моделирования прохождения значений через схемы - это не то, о чём вам обычно приходится беспокоиться.

source: Options...
ru_ru: Параметры...

source: /** Returns a copy of this object.
ru_ru: /** Возвращает копию этого объекта.

source: Clear: When 0 or undefined, this input has no effect.
ru_ru: Очистка: если на этом входе 0 или неопределённое значение, то он не имеет эффекта.

source: For software which is copyrighted by the Free Software Foundation, write to the Free Software Foundation; we sometimes make exceptions for this.
ru_ru: Для ПО, которое охраняется авторскими правами Фонда Свободного ПО, напишите в Фонд Свободного ПО; мы иногда делаем исключения для этого.

source: In the current version of Logisim, text editing features are still fairly primitive.
ru_ru: В текущей версии Logisim функции редактирования текста всё ещё довольно примитивны.

source: If yes, the input is negated before it is fed into the gate.
ru_ru: Если Да, то значение на входе инвертируется до подачи на элемент.

source: You can view and edit the expressions using the window's last two tabs, the Expression tab and the Minimized tab.
ru_ru: Вы можете просматривать и редактировать выражения, используя две последние вкладки: Выражение и Минимизация.

source: D on west edge (input, bit width matches Data Bit Width attribute)
ru_ru: D на западном крае (вход, разрядность соответствует атрибуту Разрядность данных)

source: Logisim supports two types of transistors, with slightly different behaviors described below; the P-type transistor is indicated by a circle connecting the gate input to its plate, while the N-type transistor has no such circle.
ru_ru: Logisim поддерживает два типа транзисторов с немного различным поведениями, описанными ниже; транзистор p-типа обозначен кружком, соединяющим вход затвор с его пластиной, а транзистор n-типа не имеет такого кружка.

source: The multibit input that is to be searched for the desired bit.
ru_ru: Многобитный вход, в значении которого ищется нужный бит.

source: The output you would see from this is shown below; it is of course different from what we saw in the previous section since now it is executing using the erroneous adder-query.circ.
ru_ru: Вывод, который вы увидите, показан ниже; он конечно отличается от того, что мы видели в предыдущем разделе, поскольку сейчас выполняется неправильный adder-query.circ.

source: Logisim will insist that you name the new circuit.
ru_ru: Logisim потребует вас дать название новой схеме.

source: Selecting one of the circuits displays the corresponding circuit.
ru_ru: Выбор одной из них отображает её.

source: Pins (assuming component faces east)
ru_ru: Контакты (предполагается, что компонент направлен на восток)

source: By default, the "Plain template" option will be selected, using the default template shipped with Logisim.
ru_ru: По умолчанию будет выбран вариант "Обычный шаблон", использующий поставляемый с Logisim шаблон по умолчанию.

source: // 16x16 image.
ru_ru: // изображение 16x16.
